In [1]:
import pandas as pd 
import numpy as np

In [7]:
s = pd.Series(range(5),index = ['e','d','a','b','c'])
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [8]:
s.sort_index()

a    2
b    3
c    4
d    1
e    0
dtype: int64

In [11]:
df = pd.DataFrame(np.arange(8).reshape(2,4),
index = ['two','one'],
columns = ['d','a','c','b'])
df

     d  a  c  b
two  0  1  2  3
one  4  5  6  7

In [12]:
df.sort_index()

     d  a  c  b
one  4  5  6  7
two  0  1  2  3

In [13]:
df.sort_index(axis=1)

     a  b  c  d
two  1  3  2  0
one  5  7  6  4

In [14]:
#ranking
import pandas as pd

In [21]:
df = pd.DataFrame ({
    "name":["aijay","ajay","balaji"],
    "current":[99,94,97],
    "overall":[180,187,181],
    "group":["A","A","B"]
})
df

     name  current  overall group
0   aijay       99      180     A
1    ajay       94      187     A
2  balaji       97      181     B

In [22]:
df["rank_def"] = df["overall"].rank()
df

     name  current  overall group  rank_def
0   aijay       99      180     A       1.0
1    ajay       94      187     A       3.0
2  balaji       97      181     B       2.0

In [23]:
df["rank_def_des"] = df["overall"].rank(ascending=False)
df= df.sort_values(by="rank_def_des")
df

     name  current  overall group  rank_def  rank_def_des
1    ajay       94      187     A       3.0           1.0
2  balaji       97      181     B       2.0           2.0
0   aijay       99      180     A       1.0           3.0